In [1]:
%gpt write a pandas code to read a file from location /data/cricket_data.csv

In [1]:
import pandas as pd
df = pd.read_csv("/data/cricket_data.csv")

<ipython-input-1-faf8ceb9efc6>:2: DtypeWarning: Columns (9,16,20,21,22,24,25,26,27,28,29,30,31,32,45,46,59,60,73,74,87,88,90,91,92,95,96,97,98,99,100,101,102) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("/data/cricket_data.csv")

In [2]:
df.re

,ID,NAME,COUNTRY,Full name,Born,Died,Current age,Major teams,Education,Height,...,BOWLING_T20s_Runs,BOWLING_T20s_Wkts,BOWLING_T20s_BBI,BOWLING_T20s_BBM,BOWLING_T20s_Ave,BOWLING_T20s_Econ,BOWLING_T20s_SR,BOWLING_T20s_4w,BOWLING_T20s_5w,BOWLING_T20s_10
0,8772,Henry Arkell,England,Henry John Denham Arkell,"\nJune 26, 1898, Edmonton, Middlesex","March 12, 1982, Oxford (aged 83 years 259 days)",NaN,Northamptonshire,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,532565,Richard Nyren,England,Richard Nyren,"\nApril 25, 1734, Eartham, Sussex","April 25, 1797, Lee or Leigh, Kent (aged 63 ye...",NaN,Hampshire XI,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,16856,Sydney Maartensz,England,Sydney Gratien Adair Maartensz,"\nApril 14, 1882, Colombo, Ceylon","September 10, 1967, Pyrford, Woking, Surrey (a...",NaN,Hampshire,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,16715,Brian Lander,England,Brian Richard Lander,"\nJanuary 9, 1942, Bishop Auckland, Co Durham",NaN,77 years 73 days,"['Durham,', 'Minor Counties']",NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,15989,Derek Kenderdine,England,Derek Charles Kenderdine,"\nOctober 28, 1897, Chislehurst, Kent","August 28, 1947, Cambridge (aged 49 years 304 ...",NaN,Royal Navy,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
90303,19777,Keith Robinson,England,Keith Robinson,"\nDecember 17, 1933, Thirsk, Yorkshire",NaN,85 years 97 days,Combined Services,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
90304,14843,Trevitt Hine-Haycock,England,Trevitt Reginald Hine-Haycock,"\nDecember 3, 1861, Little Heath, Old Charlton...","November 2, 1953, Bedford (aged 91 years 334 d...",NaN,"['Kent,', 'Oxford University']",NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
90305,15025,John Hughes,England,John Hughes,"\nJuly 2, 1825, Hertford","January 29, 1907, Hertford (aged 81 years 211 ...",NaN,South of England,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
90306,11167,John Clayton,England,John Morton Clayton,"\nNovember 17, 1857, Chesterfield, Derbyshire","April 1, 1938, West Southbourne, Hampshire (ag...",NaN,Derbyshire,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
90307,565677,H Clewitt,England,H Clewitt,\ndate unknown,NaN,NaN,Lincolnshire,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [17]:
import pandas as pd
import json

def parse_files(path):
    #read the json file
    with open('/data/odis_male_json/'+path) as f:
      data = json.load(f)

    #convert the file contents into a pandas dataframe
    df = pd.DataFrame.from_dict(data["info"], orient='index')
    #print(path)
    return df.T

In [43]:
print("Loading Records")
import os
df = pd.DataFrame()

folder = '/data/odis_male_json'

files = os.listdir(folder)
for file in files:
    df1 = parse_files(file)
    #print(df1.head())
    df = pd.concat([df, df1], ignore_index=True)

Loading Records

In [46]:
%gpt write a pandas function to read a field name winner inside a nested json from the column outcome of dataframe by name df and create a new variable called match_winner

Please enter openai api key: ········

In [47]:
df['match_winner'] = df['outcome'].apply(lambda x: x['winner'] if 'winner' in x else None)

In [49]:
%gpt in pandas column by the name teams have an array of records. write a pandas code to fetch the 0th element of the array as team1 and 1st element of the array as team 2

In [50]:
# Fetch 0th element of the array as team1 and 1st element of the array as team2
df["team1"] = df['teams'].map(lambda x: x[0])
df["team2"] = df['teams'].map(lambda x: x[1])

In [54]:
%gpt from the pandas dataframe by name df drop column supersubs

In [ ]:
df.drop('supersubs', axis=1)

In [34]:
%gpt ValueError: Cannot mask with non-boolean array containing NA / NaN values

In [ ]:
This error occurs when trying to mask an array with a non-boolean array that contains missing or invalid values (such as NA or NaN). Masking is the process of selecting a subset of elements from an array according to certain criteria. In order to do this, the criteria must be expressed as a boolean array, meaning that all elements must be either True or False. If the array contains any missing or invalid values (such as NA or NaN), then it cannot be used for masking and this error will be thrown.

In [27]:
df1 = df.query('NAME like "%%Head%%"')

SyntaxError: invalid syntax (<unknown>, line 1)